Revit 2026 API

# RevisionVisibility Property

---

Controls the visibility of revision clouds and revision tags related to this Revision.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RevisionVisibility Visibility { get; set; }
```
```vb
Public Property Visibility As RevisionVisibility
	Get
	Set
```
```cpp
public:
property RevisionVisibility Visibility {
	RevisionVisibility get ();
	void set (RevisionVisibility value);
}
```
```fsharp
member Visibility : RevisionVisibility with get, set
```

#### Property Value

RevisionVisibility

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This property provides project-wide control over the visibility of revision clouds and tags associated with this Revision. If clouds or tags are hidden by this property they will not be visible in any views regardless of the view's settings. If clouds or tags are visible according to this property they may still be hidden on a particular view or sheet.

#### Reference

Revision Class

Autodesk.Revit.DB Namespace